Revit 2027 API
MEPNetworkSegmentData.FlowState Property
 The calculated flow state of this segment.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PipeFlowState FlowState { get; }
Public ReadOnly Property FlowState As PipeFlowState
	Get
public:
property PipeFlowState FlowState {
	PipeFlowState get ();
}
member FlowState : PipeFlowState with get
Property Value
PipeFlowState
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace